smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN26 */
#define IFX_GTM_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN26 */
#define IFX_GTM_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN26 */
#define IFX_GTM_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN27 */
#define IFX_GTM_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN27 */
#define IFX_GTM_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN27 */
#define IFX_GTM_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN28 */
#define IFX_GTM_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN28 */
#define IFX_GTM_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN28 */
#define IFX_GTM_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN29 */
#define IFX_GTM_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN29 */
#define IFX_GTM_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN29 */
#define IFX_GTM_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN2 */
#define IFX_GTM_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN2 */
#define IFX_GTM_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN2 */
#define IFX_GTM_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN30 */
#define IFX_GTM_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN30 */
#define IFX_GTM_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN30 */
#define IFX_GTM_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN31 */
#define IFX_GTM_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN31 */
#define IFX_GTM_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN31 */
#define IFX_GTM_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN3 */
#define IFX_GTM_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN3 */
#define IFX_GTM_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN3 */
#define IFX_GTM_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN4 */
#define IFX_GTM_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN4 */
#define IFX_GTM_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN4 */
#define IFX_GTM_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN5 */
#define IFX_GTM_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN5 */
#define IFX_GTM_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN5 */
#define IFX_GTM_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN6 */
#define IFX_GTM_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN6 */
#define IFX_GTM_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN6 */
#define IFX_GTM_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN7 */
#define IFX_GTM_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN7 */
#define IFX_GTM_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN7 */
#define IFX_GTM_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN8 */
#define IFX_GTM_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN8 */
#define IFX_GTM_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN8 */
#define IFX_GTM_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_GTM_ACCEN0_Bits.EN9 */
#define IFX_GTM_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_GTM_ACCEN0_Bits.EN9 */
#define IFX_GTM_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ACCEN0_Bits.EN9 */
#define IFX_GTM_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG0OUT0_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG0OUT0_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL0 */
#define IFX_GTM_ADCTRIG0OUT0_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG0OUT0_SEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG0OUT0_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL1 */
#define IFX_GTM_ADCTRIG0OUT0_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG0OUT0_SEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG0OUT0_SEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL2 */
#define IFX_GTM_ADCTRIG0OUT0_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG0OUT0_SEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG0OUT0_SEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL3 */
#define IFX_GTM_ADCTRIG0OUT0_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG0OUT0_SEL4_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG0OUT0_SEL4_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL4 */
#define IFX_GTM_ADCTRIG0OUT0_SEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG0OUT0_SEL5_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG0OUT0_SEL5_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL5 */
#define IFX_GTM_ADCTRIG0OUT0_SEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG0OUT0_SEL6_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG0OUT0_SEL6_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL6 */
#define IFX_GTM_ADCTRIG0OUT0_SEL6_OFF (24u)

/** \brief  Length for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG0OUT0_SEL7_LEN (4u)

/** \brief  Mask for Ifx_GTM_ADCTRIG0OUT0_Bits.SEL7 */
#define IFX_GTM_ADCTRIG0OUT0_SEL7_MSK (0xfu)

