smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ATOM_CH_STAT_Bits.WRF */
#define IFX_GTM_ATOM_CH_STAT_WRF_OFF (22u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_EIRQ_EN_DEST_ERR_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN0_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN0_OFF (1u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN10_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN10_OFF (11u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN11_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN11_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN1_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN1_OFF (2u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN2_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN2_OFF (3u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN3_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN3_OFF (4u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN4_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN4 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN4_OFF (5u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN5_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN5 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN5_OFF (6u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN6_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN6 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN6_OFF (7u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN7 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN7_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN7 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN7 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN7_OFF (8u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN8 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN8_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN8 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN8 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN8_OFF (9u)

/** \brief  Length for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN9_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_EIRQ_EN_Bits.DID_EN9 */
#define IFX_GTM_BRC_EIRQ_EN_DID_EN9_OFF (10u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_IRQ_EN_DEST_ERR_EN_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_IRQ_EN_DEST_ERR_EN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DEST_ERR_EN */
#define IFX_GTM_BRC_IRQ_EN_DEST_ERR_EN_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN0_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN0 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN0_OFF (1u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN10_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN10 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN10_OFF (11u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN11_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN11 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN11_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN1_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN1 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN1_OFF (2u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN2_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN2 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN2_OFF (3u)

/** \brief  Length for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN3_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_IRQ_EN_Bits.DID_EN3 */
#define IFX_GTM_BRC_IRQ_EN_DID_EN3_OFF (4u)

