smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST19_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST19 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST19_OFF (19u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST1_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST1 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST1_OFF (1u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST20_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST20_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST20 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST20_OFF (20u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST21_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST21_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST21 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST21_OFF (21u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST2_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST2 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST2_OFF (2u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST3_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST3 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST3_OFF (3u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST4_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST4_OFF (4u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST5_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST5_OFF (5u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST6_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST6_OFF (6u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST7_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST7_OFF (7u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST8_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST8_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST8_OFF (8u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST9_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST9_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC1_DEST_EN_DEST9_OFF (9u)

/** \brief  Length for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC1_DEST_EN_TRASHBIN_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC1_DEST_EN_TRASHBIN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC1_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC1_DEST_EN_TRASHBIN_OFF (22u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC2_ADDR_ADDR_LEN (9u)

/** \brief  Mask for Ifx_GTM_BRC_SRC2_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC2_ADDR_ADDR_MSK (0x1ffu)

/** \brief  Offset for Ifx_GTM_BRC_SRC2_ADDR_Bits.ADDR */
#define IFX_GTM_BRC_SRC2_ADDR_ADDR_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC2_ADDR_BRC_MODE_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC2_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC2_ADDR_BRC_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC2_ADDR_Bits.BRC_MODE */
#define IFX_GTM_BRC_SRC2_ADDR_BRC_MODE_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST0_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST0 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST0_OFF (0u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST10_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST10 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST10_OFF (10u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST11_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST11 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST11_OFF (11u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST12_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST12 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST12_OFF (12u)

/** \brief  Length for Ifx_GTM_BRC_SRC2_DEST_Bits.EN_DEST13 */
#define IFX_GTM_BRC_SRC2_DEST_EN_DEST13_LEN (1u)

