smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST4 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST4_OFF (4u)

/** \brief  Length for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST5_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST5 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST5_OFF (5u)

/** \brief  Length for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST6_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST6 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST6_OFF (6u)

/** \brief  Length for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST7_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST7 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST7_OFF (7u)

/** \brief  Length for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST8_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST8_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST8 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST8_OFF (8u)

/** \brief  Length for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST9_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST9_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_DEST9 */
#define IFX_GTM_BRC_SRC9_DEST_EN_DEST9_OFF (9u)

/** \brief  Length for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC9_DEST_EN_TRASHBIN_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC9_DEST_EN_TRASHBIN_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRC_SRC9_DEST_Bits.EN_TRASHBIN */
#define IFX_GTM_BRC_SRC9_DEST_EN_TRASHBIN_OFF (22u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BRG_MODE */
#define IFX_GTM_BRIDGE_MODE_BRG_MODE_OFF (0u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BRG_RST */
#define IFX_GTM_BRIDGE_MODE_BRG_RST_OFF (16u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_LEN (8u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_MSK (0xffu)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_DPT */
#define IFX_GTM_BRIDGE_MODE_BUFF_DPT_OFF (24u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.BUFF_OVL */
#define IFX_GTM_BRIDGE_MODE_BUFF_OVL_OFF (9u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.MODE_UP_PGR */
#define IFX_GTM_BRIDGE_MODE_MODE_UP_PGR_OFF (8u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.MSK_WR_RSP */
#define IFX_GTM_BRIDGE_MODE_MSK_WR_RSP_OFF (1u)

/** \brief  Length for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_LEN (1u)

/** \brief  Mask for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_BRIDGE_MODE_Bits.SYNC_INPUT_REG */
#define IFX_GTM_BRIDGE_MODE_SYNC_INPUT_REG_OFF (12u)

/** \brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_LEN (5u)

/** \brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.ABT_TRAN_PGR */
#define IFX_GTM_BRIDGE_PTR1_ABT_TRAN_PGR_OFF (15u)

/** \brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_LEN (6u)

/** \brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_MSK (0x3fu)

/** \brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.FBC */
#define IFX_GTM_BRIDGE_PTR1_FBC_OFF (20u)

/** \brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_LEN (5u)

/** \brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.FIRST_RSP_PTR */
#define IFX_GTM_BRIDGE_PTR1_FIRST_RSP_PTR_OFF (5u)

/** \brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_LEN (5u)

/** \brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_MSK (0x1fu)

/** \brief  Offset for Ifx_GTM_BRIDGE_PTR1_Bits.NEW_TRAN_PTR */
#define IFX_GTM_BRIDGE_PTR1_NEW_TRAN_PTR_OFF (0u)

/** \brief  Length for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_LEN (6u)

/** \brief  Mask for Ifx_GTM_BRIDGE_PTR1_Bits.RSP_TRAN_RDY */
#define IFX_GTM_BRIDGE_PTR1_RSP_TRAN_RDY_MSK (0x3fu)

