smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD1 */
#define IFX_GTM_DPLL_CTRL_2_WAD1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD1 */
#define IFX_GTM_DPLL_CTRL_2_WAD1_OFF (17u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD2 */
#define IFX_GTM_DPLL_CTRL_2_WAD2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD2 */
#define IFX_GTM_DPLL_CTRL_2_WAD2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD2 */
#define IFX_GTM_DPLL_CTRL_2_WAD2_OFF (18u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD3 */
#define IFX_GTM_DPLL_CTRL_2_WAD3_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD3 */
#define IFX_GTM_DPLL_CTRL_2_WAD3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD3 */
#define IFX_GTM_DPLL_CTRL_2_WAD3_OFF (19u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD4 */
#define IFX_GTM_DPLL_CTRL_2_WAD4_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD4 */
#define IFX_GTM_DPLL_CTRL_2_WAD4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD4 */
#define IFX_GTM_DPLL_CTRL_2_WAD4_OFF (20u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD5 */
#define IFX_GTM_DPLL_CTRL_2_WAD5_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD5 */
#define IFX_GTM_DPLL_CTRL_2_WAD5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD5 */
#define IFX_GTM_DPLL_CTRL_2_WAD5_OFF (21u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD6 */
#define IFX_GTM_DPLL_CTRL_2_WAD6_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD6 */
#define IFX_GTM_DPLL_CTRL_2_WAD6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD6 */
#define IFX_GTM_DPLL_CTRL_2_WAD6_OFF (22u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_2_Bits.WAD7 */
#define IFX_GTM_DPLL_CTRL_2_WAD7_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_2_Bits.WAD7 */
#define IFX_GTM_DPLL_CTRL_2_WAD7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_2_Bits.WAD7 */
#define IFX_GTM_DPLL_CTRL_2_WAD7_OFF (23u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN10 */
#define IFX_GTM_DPLL_CTRL_3_AEN10_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN10 */
#define IFX_GTM_DPLL_CTRL_3_AEN10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN10 */
#define IFX_GTM_DPLL_CTRL_3_AEN10_OFF (10u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN11 */
#define IFX_GTM_DPLL_CTRL_3_AEN11_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN11 */
#define IFX_GTM_DPLL_CTRL_3_AEN11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN11 */
#define IFX_GTM_DPLL_CTRL_3_AEN11_OFF (11u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN12 */
#define IFX_GTM_DPLL_CTRL_3_AEN12_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN12 */
#define IFX_GTM_DPLL_CTRL_3_AEN12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN12 */
#define IFX_GTM_DPLL_CTRL_3_AEN12_OFF (12u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN13 */
#define IFX_GTM_DPLL_CTRL_3_AEN13_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN13 */
#define IFX_GTM_DPLL_CTRL_3_AEN13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN13 */
#define IFX_GTM_DPLL_CTRL_3_AEN13_OFF (13u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN14 */
#define IFX_GTM_DPLL_CTRL_3_AEN14_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN14 */
#define IFX_GTM_DPLL_CTRL_3_AEN14_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN14 */
#define IFX_GTM_DPLL_CTRL_3_AEN14_OFF (14u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN15 */
#define IFX_GTM_DPLL_CTRL_3_AEN15_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN15 */
#define IFX_GTM_DPLL_CTRL_3_AEN15_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN15 */
#define IFX_GTM_DPLL_CTRL_3_AEN15_OFF (15u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN8 */
#define IFX_GTM_DPLL_CTRL_3_AEN8_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN8 */
#define IFX_GTM_DPLL_CTRL_3_AEN8_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN8 */
#define IFX_GTM_DPLL_CTRL_3_AEN8_OFF (8u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.AEN9 */
#define IFX_GTM_DPLL_CTRL_3_AEN9_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.AEN9 */
#define IFX_GTM_DPLL_CTRL_3_AEN9_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.AEN9 */
#define IFX_GTM_DPLL_CTRL_3_AEN9_OFF (9u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD10 */
#define IFX_GTM_DPLL_CTRL_3_WAD10_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD10 */
#define IFX_GTM_DPLL_CTRL_3_WAD10_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD10 */
#define IFX_GTM_DPLL_CTRL_3_WAD10_OFF (18u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD11 */
#define IFX_GTM_DPLL_CTRL_3_WAD11_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD11 */
#define IFX_GTM_DPLL_CTRL_3_WAD11_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD11 */
#define IFX_GTM_DPLL_CTRL_3_WAD11_OFF (19u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD12 */
#define IFX_GTM_DPLL_CTRL_3_WAD12_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD12 */
#define IFX_GTM_DPLL_CTRL_3_WAD12_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD12 */
#define IFX_GTM_DPLL_CTRL_3_WAD12_OFF (20u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD13 */
#define IFX_GTM_DPLL_CTRL_3_WAD13_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD13 */
#define IFX_GTM_DPLL_CTRL_3_WAD13_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD13 */
#define IFX_GTM_DPLL_CTRL_3_WAD13_OFF (21u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD14 */
#define IFX_GTM_DPLL_CTRL_3_WAD14_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD14 */
#define IFX_GTM_DPLL_CTRL_3_WAD14_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD14 */
#define IFX_GTM_DPLL_CTRL_3_WAD14_OFF (22u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD15 */
#define IFX_GTM_DPLL_CTRL_3_WAD15_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_CTRL_3_Bits.WAD15 */
#define IFX_GTM_DPLL_CTRL_3_WAD15_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_CTRL_3_Bits.WAD15 */
#define IFX_GTM_DPLL_CTRL_3_WAD15_OFF (23u)

/** \brief  Length for Ifx_GTM_DPLL_CTRL_3_Bits.WAD8 */
#define IFX_GTM_DPLL_CTRL_3_WAD8_LEN (1u)

