smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_OSW_Bits.SWON_T */
#define IFX_GTM_DPLL_OSW_SWON_T_OFF (1u)

/** \brief  Length for Ifx_GTM_DPLL_PDT_T_Bits.DB */
#define IFX_GTM_DPLL_PDT_T_DB_LEN (14u)

/** \brief  Mask for Ifx_GTM_DPLL_PDT_T_Bits.DB */
#define IFX_GTM_DPLL_PDT_T_DB_MSK (0x3fffu)

/** \brief  Offset for Ifx_GTM_DPLL_PDT_T_Bits.DB */
#define IFX_GTM_DPLL_PDT_T_DB_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PDT_T_Bits.DW */
#define IFX_GTM_DPLL_PDT_T_DW_LEN (10u)

/** \brief  Mask for Ifx_GTM_DPLL_PDT_T_Bits.DW */
#define IFX_GTM_DPLL_PDT_T_DW_MSK (0x3ffu)

/** \brief  Offset for Ifx_GTM_DPLL_PDT_T_Bits.DW */
#define IFX_GTM_DPLL_PDT_T_DW_OFF (14u)

/** \brief  Length for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSA_Bits.PSA */
#define IFX_GTM_DPLL_PSA_PSA_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSAC_Bits.PSAC */
#define IFX_GTM_DPLL_PSAC_PSAC_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSSC_Bits.PSSC */
#define IFX_GTM_DPLL_PSSC_PSSC_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSSM_0_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_0_PSSM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSSM_0_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_0_PSSM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSSM_0_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_0_PSSM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSSM_1_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_1_PSSM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSSM_1_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_1_PSSM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSSM_1_Bits.PSSM */
#define IFX_GTM_DPLL_PSSM_1_PSSM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSTC_Bits.PSTC */
#define IFX_GTM_DPLL_PSTC_PSTC_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSTM_0_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_0_PSTM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSTM_0_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_0_PSTM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSTM_0_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_0_PSTM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PSTM_1_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_1_PSTM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PSTM_1_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_1_PSTM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PSTM_1_Bits.PSTM */
#define IFX_GTM_DPLL_PSTM_1_PSTM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_PVT_Bits.PVT */
#define IFX_GTM_DPLL_PVT_PVT_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1A */
#define IFX_GTM_DPLL_RAM_INI_INIT_1A_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1B */
#define IFX_GTM_DPLL_RAM_INI_INIT_1B_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1B */
#define IFX_GTM_DPLL_RAM_INI_INIT_1B_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_1B */
#define IFX_GTM_DPLL_RAM_INI_INIT_1B_OFF (1u)

/** \brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_2 */
#define IFX_GTM_DPLL_RAM_INI_INIT_2_OFF (2u)

/** \brief  Length for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_LEN (1u)

/** \brief  Mask for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_DPLL_RAM_INI_Bits.INIT_RAM */
#define IFX_GTM_DPLL_RAM_INI_INIT_RAM_OFF (4u)

/** \brief  Length for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_RCDT_SX_NOM_Bits.RCDT_SX_NOM */
#define IFX_GTM_DPLL_RCDT_SX_NOM_RCDT_SX_NOM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_RCDT_SX_Bits.RCDT_SX */
#define IFX_GTM_DPLL_RCDT_SX_RCDT_SX_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_RCDT_TX_NOM_Bits.RCDT_TX_NOM */
#define IFX_GTM_DPLL_RCDT_TX_NOM_RCDT_TX_NOM_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_LEN (24u)

/** \brief  Mask for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_MSK (0xffffffu)

/** \brief  Offset for Ifx_GTM_DPLL_RCDT_TX_Bits.RCDT_TX */
#define IFX_GTM_DPLL_RCDT_TX_RCDT_TX_OFF (0u)

/** \brief  Length for Ifx_GTM_DPLL_RDT_S_ACT_Bits.RDT_S_ACT */
#define IFX_GTM_DPLL_RDT_S_ACT_RDT_S_ACT_LEN (24u)

