smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TAX_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TAX_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE0_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE0_IRQ_OFF (18u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE1_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE1_IRQ_OFF (19u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE2_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE2_IRQ_OFF (20u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE3_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE3_IRQ_OFF (21u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TE4_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TE4_IRQ_OFF (22u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIN_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIN_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TIS_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TIS_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_TORI_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_TORI_IRQ_OFF (25u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W1I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W1I_IRQ_OFF (12u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_1_Bits.DPLL_W2I_IRQ */
#define IFX_GTM_ICM_IRQG_1_DPLL_W2I_IRQ_OFF (11u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH0_IRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH1_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH2_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH3_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH4_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH5_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH6_IRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM0_CH7_IRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM1_CH0_IRQ_LEN (1u)

