smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH2_IRQ_OFF (26u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH3_IRQ_OFF (27u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH4_IRQ_OFF (28u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH5_IRQ_OFF (29u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH6_IRQ_OFF (30u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_2_Bits.TIM3_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_2_TIM3_CH7_IRQ_OFF (31u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH0_IRQ_OFF (0u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH1_IRQ_OFF (1u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH2_IRQ_OFF (2u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH3_IRQ_OFF (3u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH4_IRQ_OFF (4u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH5_IRQ_OFF (5u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH6_IRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS0_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS0_CH7_IRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH0_IRQ_OFF (8u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH1_IRQ_OFF (9u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH2_IRQ_OFF (10u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH3_IRQ_OFF (11u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH4_IRQ_OFF (12u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_4_Bits.MCS1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_4_MCS1_CH5_IRQ_OFF (13u)

