smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH1_IRQ_OFF (9u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH2_IRQ_OFF (10u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH3_IRQ_OFF (11u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH4_IRQ_OFF (12u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH5_IRQ_OFF (13u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH6_IRQ_OFF (14u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM1_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM1_CH7_IRQ_OFF (15u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH0_IRQ_OFF (16u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH1_IRQ_OFF (17u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH2_IRQ_OFF (18u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH3_IRQ_OFF (19u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH4_IRQ_OFF (20u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH5_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH5_IRQ_OFF (21u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH6_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH6_IRQ_OFF (22u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM2_CH7_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM2_CH7_IRQ_OFF (23u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH0_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH0_IRQ_OFF (24u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH1_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH1_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH1_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH1_IRQ_OFF (25u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH2_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH2_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH2_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH2_IRQ_OFF (26u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH3_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH3_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH3_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH3_IRQ_OFF (27u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH4_IRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH4_IRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_9_Bits.ATOM3_CH4_IRQ */
#define IFX_GTM_ICM_IRQG_9_ATOM3_CH4_IRQ_OFF (28u)

