smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM2_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM2_EIRQ_OFF (6u)

/** \brief  Length for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_LEN (1u)

/** \brief  Mask for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_ICM_IRQG_MEI_Bits.TIM3_EIRQ */
#define IFX_GTM_ICM_IRQG_MEI_TIM3_EIRQ_OFF (7u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL0 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL1 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL2 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL3 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL4 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL5 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL6 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL6_OFF (24u)

/** \brief  Length for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_CAN_OUTSEL_Bits.SEL7 */
#define IFX_GTM_INOUTSEL_CAN_OUTSEL_SEL7_OFF (28u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL0 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL0_OFF (0u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL1 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL1_OFF (4u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL2 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL2_OFF (8u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL3 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL3_OFF (12u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL4 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL4_OFF (16u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL5 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL5_OFF (20u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_MSK (0xfu)

/** \brief  Offset for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL6 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL6_OFF (24u)

/** \brief  Length for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_LEN (4u)

/** \brief  Mask for Ifx_GTM_INOUTSEL_DSADC_INSEL_Bits.INSEL7 */
#define IFX_GTM_INOUTSEL_DSADC_INSEL_INSEL7_MSK (0xfu)

