smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT0 */
#define IFX_GTM_MCS_RST_CAT0_OFF (8u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT1 */
#define IFX_GTM_MCS_RST_CAT1_OFF (9u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT2 */
#define IFX_GTM_MCS_RST_CAT2_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT2 */
#define IFX_GTM_MCS_RST_CAT2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT2 */
#define IFX_GTM_MCS_RST_CAT2_OFF (10u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT3 */
#define IFX_GTM_MCS_RST_CAT3_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT3 */
#define IFX_GTM_MCS_RST_CAT3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT3 */
#define IFX_GTM_MCS_RST_CAT3_OFF (11u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT4 */
#define IFX_GTM_MCS_RST_CAT4_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT4 */
#define IFX_GTM_MCS_RST_CAT4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT4 */
#define IFX_GTM_MCS_RST_CAT4_OFF (12u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT5 */
#define IFX_GTM_MCS_RST_CAT5_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT5 */
#define IFX_GTM_MCS_RST_CAT5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT5 */
#define IFX_GTM_MCS_RST_CAT5_OFF (13u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT6 */
#define IFX_GTM_MCS_RST_CAT6_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT6 */
#define IFX_GTM_MCS_RST_CAT6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT6 */
#define IFX_GTM_MCS_RST_CAT6_OFF (14u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CAT7 */
#define IFX_GTM_MCS_RST_CAT7_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CAT7 */
#define IFX_GTM_MCS_RST_CAT7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CAT7 */
#define IFX_GTM_MCS_RST_CAT7_OFF (15u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT0 */
#define IFX_GTM_MCS_RST_CWT0_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT0 */
#define IFX_GTM_MCS_RST_CWT0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT0 */
#define IFX_GTM_MCS_RST_CWT0_OFF (16u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT1 */
#define IFX_GTM_MCS_RST_CWT1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT1 */
#define IFX_GTM_MCS_RST_CWT1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT1 */
#define IFX_GTM_MCS_RST_CWT1_OFF (17u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT2 */
#define IFX_GTM_MCS_RST_CWT2_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT2 */
#define IFX_GTM_MCS_RST_CWT2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT2 */
#define IFX_GTM_MCS_RST_CWT2_OFF (18u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT3 */
#define IFX_GTM_MCS_RST_CWT3_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT3 */
#define IFX_GTM_MCS_RST_CWT3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT3 */
#define IFX_GTM_MCS_RST_CWT3_OFF (19u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT4 */
#define IFX_GTM_MCS_RST_CWT4_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT4 */
#define IFX_GTM_MCS_RST_CWT4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT4 */
#define IFX_GTM_MCS_RST_CWT4_OFF (20u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT5 */
#define IFX_GTM_MCS_RST_CWT5_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT5 */
#define IFX_GTM_MCS_RST_CWT5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT5 */
#define IFX_GTM_MCS_RST_CWT5_OFF (21u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT6 */
#define IFX_GTM_MCS_RST_CWT6_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT6 */
#define IFX_GTM_MCS_RST_CWT6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT6 */
#define IFX_GTM_MCS_RST_CWT6_OFF (22u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.CWT7 */
#define IFX_GTM_MCS_RST_CWT7_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.CWT7 */
#define IFX_GTM_MCS_RST_CWT7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.CWT7 */
#define IFX_GTM_MCS_RST_CWT7_OFF (23u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST0 */
#define IFX_GTM_MCS_RST_RST0_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST0 */
#define IFX_GTM_MCS_RST_RST0_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST0 */
#define IFX_GTM_MCS_RST_RST0_OFF (0u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST1 */
#define IFX_GTM_MCS_RST_RST1_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST1 */
#define IFX_GTM_MCS_RST_RST1_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST1 */
#define IFX_GTM_MCS_RST_RST1_OFF (1u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST2 */
#define IFX_GTM_MCS_RST_RST2_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST2 */
#define IFX_GTM_MCS_RST_RST2_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST2 */
#define IFX_GTM_MCS_RST_RST2_OFF (2u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST3 */
#define IFX_GTM_MCS_RST_RST3_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST3 */
#define IFX_GTM_MCS_RST_RST3_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST3 */
#define IFX_GTM_MCS_RST_RST3_OFF (3u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST4 */
#define IFX_GTM_MCS_RST_RST4_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST4 */
#define IFX_GTM_MCS_RST_RST4_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST4 */
#define IFX_GTM_MCS_RST_RST4_OFF (4u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST5 */
#define IFX_GTM_MCS_RST_RST5_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST5 */
#define IFX_GTM_MCS_RST_RST5_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST5 */
#define IFX_GTM_MCS_RST_RST5_OFF (5u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST6 */
#define IFX_GTM_MCS_RST_RST6_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST6 */
#define IFX_GTM_MCS_RST_RST6_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST6 */
#define IFX_GTM_MCS_RST_RST6_OFF (6u)

/** \brief  Length for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCS_RST_Bits.RST7 */
#define IFX_GTM_MCS_RST_RST7_OFF (7u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS000 */
#define IFX_GTM_MCSINTCLR_MCS000_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS000 */
#define IFX_GTM_MCSINTCLR_MCS000_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS000 */
#define IFX_GTM_MCSINTCLR_MCS000_OFF (0u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS001 */
#define IFX_GTM_MCSINTCLR_MCS001_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS001 */
#define IFX_GTM_MCSINTCLR_MCS001_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS001 */
#define IFX_GTM_MCSINTCLR_MCS001_OFF (1u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS010 */
#define IFX_GTM_MCSINTCLR_MCS010_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS010 */
#define IFX_GTM_MCSINTCLR_MCS010_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS010 */
#define IFX_GTM_MCSINTCLR_MCS010_OFF (2u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS011 */
#define IFX_GTM_MCSINTCLR_MCS011_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS011 */
#define IFX_GTM_MCSINTCLR_MCS011_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS011 */
#define IFX_GTM_MCSINTCLR_MCS011_OFF (3u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS100 */
#define IFX_GTM_MCSINTCLR_MCS100_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS100 */
#define IFX_GTM_MCSINTCLR_MCS100_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS100 */
#define IFX_GTM_MCSINTCLR_MCS100_OFF (4u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS101 */
#define IFX_GTM_MCSINTCLR_MCS101_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS101 */
#define IFX_GTM_MCSINTCLR_MCS101_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS101 */
#define IFX_GTM_MCSINTCLR_MCS101_OFF (5u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS110 */
#define IFX_GTM_MCSINTCLR_MCS110_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS110 */
#define IFX_GTM_MCSINTCLR_MCS110_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS110 */
#define IFX_GTM_MCSINTCLR_MCS110_OFF (6u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS111 */
#define IFX_GTM_MCSINTCLR_MCS111_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS111 */
#define IFX_GTM_MCSINTCLR_MCS111_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS111 */
#define IFX_GTM_MCSINTCLR_MCS111_OFF (7u)

