smileAs/discovery_tc27x/ThirdParty/Mcal_Tc2xx/Supply/MC-ISAR_AS4XX_AURIX_TC27X_DC_PB_BASE_V500_REL322/TC27x_DCstep/Aurix_MC-ISAR/general/tricore/inc/TC27xD/IfxGtm_bf.h
/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS200 */
#define IFX_GTM_MCSINTCLR_MCS200_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS200 */
#define IFX_GTM_MCSINTCLR_MCS200_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS200 */
#define IFX_GTM_MCSINTCLR_MCS200_OFF (8u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS201 */
#define IFX_GTM_MCSINTCLR_MCS201_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS201 */
#define IFX_GTM_MCSINTCLR_MCS201_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS201 */
#define IFX_GTM_MCSINTCLR_MCS201_OFF (9u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS210 */
#define IFX_GTM_MCSINTCLR_MCS210_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS210 */
#define IFX_GTM_MCSINTCLR_MCS210_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS210 */
#define IFX_GTM_MCSINTCLR_MCS210_OFF (10u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS211 */
#define IFX_GTM_MCSINTCLR_MCS211_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS211 */
#define IFX_GTM_MCSINTCLR_MCS211_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS211 */
#define IFX_GTM_MCSINTCLR_MCS211_OFF (11u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS300 */
#define IFX_GTM_MCSINTCLR_MCS300_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS300 */
#define IFX_GTM_MCSINTCLR_MCS300_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS300 */
#define IFX_GTM_MCSINTCLR_MCS300_OFF (12u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS301 */
#define IFX_GTM_MCSINTCLR_MCS301_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS301 */
#define IFX_GTM_MCSINTCLR_MCS301_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS301 */
#define IFX_GTM_MCSINTCLR_MCS301_OFF (13u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS310 */
#define IFX_GTM_MCSINTCLR_MCS310_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS310 */
#define IFX_GTM_MCSINTCLR_MCS310_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS310 */
#define IFX_GTM_MCSINTCLR_MCS310_OFF (14u)

/** \brief  Length for Ifx_GTM_MCSINTCLR_Bits.MCS311 */
#define IFX_GTM_MCSINTCLR_MCS311_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTCLR_Bits.MCS311 */
#define IFX_GTM_MCSINTCLR_MCS311_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTCLR_Bits.MCS311 */
#define IFX_GTM_MCSINTCLR_MCS311_OFF (15u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS000 */
#define IFX_GTM_MCSINTSTAT_MCS000_OFF (0u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS001 */
#define IFX_GTM_MCSINTSTAT_MCS001_OFF (1u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS010 */
#define IFX_GTM_MCSINTSTAT_MCS010_OFF (2u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS011 */
#define IFX_GTM_MCSINTSTAT_MCS011_OFF (3u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS100 */
#define IFX_GTM_MCSINTSTAT_MCS100_OFF (4u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS101 */
#define IFX_GTM_MCSINTSTAT_MCS101_OFF (5u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS110 */
#define IFX_GTM_MCSINTSTAT_MCS110_OFF (6u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS111 */
#define IFX_GTM_MCSINTSTAT_MCS111_OFF (7u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS200 */
#define IFX_GTM_MCSINTSTAT_MCS200_OFF (8u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS201 */
#define IFX_GTM_MCSINTSTAT_MCS201_OFF (9u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS210 */
#define IFX_GTM_MCSINTSTAT_MCS210_OFF (10u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS211 */
#define IFX_GTM_MCSINTSTAT_MCS211_OFF (11u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_MSK (0x1u)

/** \brief  Offset for Ifx_GTM_MCSINTSTAT_Bits.MCS300 */
#define IFX_GTM_MCSINTSTAT_MCS300_OFF (12u)

/** \brief  Length for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_LEN (1u)

/** \brief  Mask for Ifx_GTM_MCSINTSTAT_Bits.MCS301 */
#define IFX_GTM_MCSINTSTAT_MCS301_MSK (0x1u)

